{"keras_version": "2.2.4", "config": {"layers": [{"config": {"activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "use_bias": true, "batch_input_shape": [null, 784], "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}