{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "use_bias": true, "units": 512, "name": "dense_1", "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "batch_input_shape": [null, 784]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "use_bias": true, "units": 512, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_3", "use_bias": true, "units": 10, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "name": "sequential_1"}, "backend": "tensorflow"}