{"backend": "tensorflow", "config": {"layers": [{"config": {"kernel_constraint": null, "bias_constraint": null, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "name": "conv2d_1", "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "use_bias": true, "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}